app/controllers/posts_controller.rb

  def show
    user = User.find(params[:id])
    post = Post.find_by_id(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT $1  [["LIMIT", 1]]

  def create
    user = User.find_by_id(params[:user_id])
    post = Post.new(post_params)
    # post.user = user
    # post.user = @current_user
    if post.save!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
INSERT INTO "posts" ("name", "title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Mar"], ["title", "Medication Pick Up"], ["content", "Bear"], ["user_id", 53], ["created_at", "2020-05-04 22:56:02.388765"], ["updated_at", "2020-05-04 22:56:02.388765"]]

  def update
    post = Post.find(params[:id])
    post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", ""], ["content", ""], ["updated_at", "2020-05-04 23:26:12.513356"], ["id", 18]]