app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]
---
  def user_posts
    @user = User.find(params[:user_id])

INSERT INTO "users" ("first_name", "email", "location", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save